Autodesk.Revit.DB.ContFootingType
An object that specifies the type of a continuous footing in Autodesk Revit.
Remarks: The structural layers of the continuous footing can be accessed via this object.